Repository: MuhammadjonTohirov/UnitedFuelFinder
Catalog: UnitedFuelFinder/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: ru, uz

source: (%@ saved)
ru: (%@ сэкономлены)
uz: (%@ tejaldi)

source: %@ saved
ru: %@ сэкономлены
uz: %@ tejaldi

source: Address
ru: Адрес

# address_info
source: Address information
ru: Адресная информация
uz: Manzil ma'lumotlari

source: All comments
ru: Все комментарии
uz: Barcha izohlar

source: All stations
ru: Все АЗС
uz: Barcha shaxobchalar

source: Already exists
ru: Уже существует
uz: Mavjud bo'lgan

# amount.saved
source: %@ (%@ saved)
ru: %@ (%@ сэкономлены)
uz: %@ (%@ tejaldi)

source: App version
ru: Версия приложения
uz: Ilova versyasi

source: Appearance
ru: Внешность
uz: Ko'rinish

source: Apply
ru: Применить
uz: Qo'llash

source: Attention
ru: Внимание
uz: Diqqat

# auth_agree_offer
source: I agree with Terms and conditions
ru: Я согласен с Условиями использования
uz: Men talab va takliflarga roziman

# auth_offer
source: Terms and conditions
ru: Условиями использования
uz: talab va takliflar

# auth_offer_description
source: To continue registration you should accept the offer, please feel free to read the whole offer
ru: Чтобы продолжить регистрацию, вам следует принять предложение. Пожалуйста, прочтите предложение целиком.
uz: Ro'yxatdan o'tishni davom ettirish uchun siz offertani qabul qilishingiz kerak, iltimos, uni to'liq o'qib chiqing.

source: Authenticate
ru: Аутентификация
uz: Autentifikatsiya

source: Camera
ru: Камера.
uz: Kamera

source: Cancel
ru: Назад
uz: Ortga

source: Card
ru: Карта
uz: Karta

# change_pin
source: Change PIN-code
ru: Изменить ПИН-код
uz: PIN kod

# change.pass.fail
source: Password change failed
ru: Сбой смены пароля
uz: Parol o'zgartirishda xatolik

# change.pass.success
source: Password changed successfully
ru: Пароль успешно изменен
uz: Parol muvaffaqiyatli o'zgartirildi

source: Change password
ru: Изменить пароль
uz: Parolni o'zgartirish

source: City
ru: Город
uz: Shahar

source: Clear
ru: Очистить
uz: Tozalash

source: Close
ru: Закрыть
uz: Yopish

source: Confirm OTP
ru: Подтвердите OTP
uz: Kodni tasdiqlang

source: Confirm PIN
ru: Подтвердить PIN-код
uz: PIN-kodni tasdiqlang

source: Confirm password
ru: Подтвердите пароль
uz: Parolni tasdiqlang

source: Confirmation code
ru: Код подтверждения
uz: Tasdiqlash kodi

source: Contact
ru: Контакт
uz: Biz bilan bog'lanish

source: Contact us
ru: Связаться с нами
uz: Biz bilan bog'lanish

source: Continue
ru: Продолжать
uz: Keyingisi

source: Current location
ru: Текущее место
uz: Joriy joylashuv

source: Dark
ru: Темный
uz: Qora

source: Dashboard
ru: Главная
uz: Asosiy

source: Delete
ru: Удалить
uz: O'chirish

source: Delete profile
ru: Удалить профиль
uz: Profilni o'chirish

# delete_profile_message
source: Do you want to delete your profile?
ru: Вы хотите удалить свой профиль?
uz: Profilingizni oʻchirishni istaysizmi?

source: Destination address
ru: Адрес назначения
uz: Belgilangan manzil

source: Detecting address
ru: Загрузка адреса
uz: Manzilni aniqlash

# device_sess
source: Device session
ru: Сеансы устройства
uz: Qurilmalar

# disclamer.desc
source: Thank you for utilizing our application. United Fuel Driver is a tool which helps you to find the cheapest price but should not be considered a guaranteed, real-time reflection of the truck stop fuel price.Our application reflects pricing provided directly to us by truck stop network members and other third parties; pricing may have changed since the last update received.
ru: Благодарим вас за использование нашего приложения. United Fuel Driver — это инструмент, который помогает вам найти самую дешевую цену, но его не следует рассматривать как гарантированное отражение цен на топливо на остановках для грузовиков в режиме реального времени. Наше приложение отражает цены, предоставленные непосредственно нам участниками сети стоянок для грузовиков и другими третьими лицами. ; цены могли измениться с момента получения последнего обновления.
uz: Ilovamizdan foydalanganingiz uchun tashakkur. United Fuel Driver - bu eng arzon narxni topishga yordam beradigan vosita, ammo real vaqtda yuk mashinalari to'xtash vaqtida yoqilg'i narxlarining kafolatlangan aksi sifatida qaralmasligi kerak. Bizning ilovamiz yuk mashinalarini to'xtatish tarmog'i a'zolari va boshqa uchinchi tomonlar tomonidan bizga to'g'ridan-to'g'ri taqdim etilgan narxlarni aks ettiradi. ; narxlar oxirgi yangilanishdan keyin o'zgargan bo'lishi mumkin.

# disclamer.desc.bold1
source: should not
ru: но его не следует рассматривать как гарантированное отражение цен
uz: kafolatlangan aksi sifatida qaralmasligi kerak

# disclamer.desc.bold3
source: pricing may have changed since the last update received.
ru: цены могли измениться с момента получения последнего обновления.
uz: narxlar oxirgi yangilanishdan keyin o'zgargan bo'lishi mumkin.

# disclamer.title
source: United Fuel Driver Disclaimer
ru: United Fuel Driver Дисклеймер
uz: United Fuel Driver Izohi

source: Discount
ru: Скидка
uz: Chegirma

source: Discounted price
ru: Цена со скидкой
uz: Chegirmadagi

# discounted_stations_pick_logic_desc
source: Select logic to get nearest discounted stations, near to current location or near to focused location by pin.
ru: Выберите логику, чтобы получить ближайшие станции со скидкой, рядом с текущим местоположением или рядом с выбранным местоположением по булавке.
uz: Eng yaqin chegirmali stansiyalarni, joriy manzilga yaqin yoki harita markazida joylashgan pin yordamida olish uchun mantiqni tanlang.

# discounted.stations.nearby
source: Nearby stations
ru: Станции рядом
uz: Atrofdagi stansiyalar

source: Distance
ru: Расстояние
uz: Masofa

source: Done
ru: Готово
uz: Tayyor

source: Driver
ru: Водитель
uz: Haydovchi

source: Edit
ru: Изменение
uz: Tahrirlash

source: Edit profile
ru: Изменение профиля
uz: Profilni tahrirlash

source: Email
ru: Эл. адрес
uz: Elektron pochta

source: Enter PIN
ru: Введите PIN-код
uz: PIN kodni kiriting

# enter.email.to.reset.pass
source: Enter email to reset password
ru: Введите email для сброса пароля
uz: Parolni tiklash uchun emailni kiriting

source: Exit
ru: Выход
uz: Chiqish

# feedback.post.fail
source: Failed to post feedback
ru: Не удалось отправить отзыв
uz: Fikrni yuborish muvaffaqiyatsiz tugadi

# feedback.post.success
source: We appreciate your feedback to this station
ru: Мы благодарим вас за ваш отзыв о этой станции
uz: Biz ushbu stantsiyaga tegishli fikringiz uchun minnatdormiz

# filter.price.range.info
source: This range will be applied to discounted price
ru: Этот диапазон будет применен к скидочной цене
uz: Ushbu oraliq chegirma narxiga qo'llaniladi

# filter.sort.by.info
source: Can be sorted by cheapest price or highest discount
ru: Можно сортировать по самой низкой цене или самой большой скидке
uz: Eng arzon narx yoki eng yuqori chegirma bo'yicha tartiblash mumkin

source: Finding route
ru: Поиск маршрута
uz: Yo'nalish qidirilmoqda

source: First name
ru: Имя
uz: Ism

source: Forgot password?
ru: Забыли пароль?
uz: Parolni unutdingizmi?

source: From
ru: Из пункта
uz: Bu yerdan

source: Fuel number
ru: Номер топлива
uz: Automobile raqami

source: Gallery
ru: Галерея
uz: Rasmlar

source: Help Desk
ru: Служба поддержки
uz: Ma'lumot markazi

source: Information
ru: Информация
uz: Ma'lumot

# insert_creds
source: Insert your credentials
ru: Вставьте свои учетные данные
uz: Ma`lumotlaringizni kiriting

source: Invalid PIN
ru: Неверный PIN-код
uz: Hato PIN

source: Invalid email
ru: Неверная почта
uz: Yaroqsiz email

source: Invalid OTP
ru: Неверный OTP
uz: Hato OTP

source: Invalid form
ru: Неверная форма
uz: Noto'g'ri forma

source: Language
ru: Язык
uz: Til

source: Last name
ru: Фамилия
uz: Familya

# last_update
source: Latest update
ru: Последнее обновление
uz: So'ngi o'zgarish

source: Latest comments
ru: Последние отзывы
uz: So'ngi izohlar

# lets_create_account
source: Let's create an account
ru: Давайте создадим учетную запись
uz: Shaxsiy hisob yaratish

# lets_sign_in_you
source: Let’s sign you in
ru: Давайте авторизуем вас
uz: Tizimga kirish.

source: Light
ru: Светлый
uz: Oq

source: List
ru: Лист

# lite
source: Light
ru: Свет
uz: Oq

source: Loading
ru: Загрузкa
uz: Yuklanmoqda

source: Loading address
ru: Загрузка адреса
uz: Manzil qidirilmoqda

source: Loading stations
ru: Загрузка АЗС
uz: Shoxobchalar yuklanmoqda

source: Location
ru: Местоположение
uz: Manzil

source: Login
ru: Войти
uz: Kirish

source: Logout
ru: Выйти
uz: Chiqish

# logout_message
source: Do you really want to log out?
ru: Вы действительно хотите выйти из системы?
uz: Chindan chiqishni istaysizmi?

source: Main point
ru: Главный пункт
uz: Asosiy nuqta

source: Map
ru: Карты
uz: Harita

source: Map PIN
ru: Значок карты
uz: Harita ko'rsatgichi

source: Map settings
ru: Настройки карты
uz: Harita sozlamalari

source: Month
ru: Месяц
uz: Oylik

source: More comments
ru: Больше отзывов
uz: Boshqa izohlar

source: Navigate
ru: Навигация
uz: Navigatsya

source: New version
ru: Новая версия
uz: Yangi versya

# new_version_available_download
source: Update application to new version
ru: Обновить приложение до новой версии
uz: Iltimos, ilovani yangilang.

source: New password
ru: Новый пароль
uz: Yangi parol

source: Next
ru: Далее
uz: Keyingi

source: No address
ru: Нет адреса
uz: Manzil yo'q

source: No item found
ru: Элемент не найден
uz: Hech nima topilmadi

source: No notifications
ru: Нет уведомлений
uz: Habar yo'q

source: No results
ru: Элемент не найден
uz: Natija mavjud emas

source: No stations found
ru: Заправок не найдено
uz: AYOQSH topilmadi

# no.account
source: Don't have an account?
ru: Нет аккаунта?
uz: Hisobingiz yo'qmi?

source: No invoices
ru: Нет счетов
uz: Fakturalar yo'q

source: No stations
ru: Нет АЗС
uz: Shaxobchalar yo'q

source: No stations around
ru: Нет АЗС поблизости
uz: Shaxobchalar topilmadi

source: No transactions
ru: Нет транзакций
uz: O'tkazmalar yo'q

# not_confirmed_by_admin
source: Your account should be verified by our customer support team. Without verification your are not able to login.
ru: Ваша учетная запись должна быть подтверждена нашей службой поддержки клиентов. Без проверки вы не сможете войти в систему.
uz: Hisobingiz mijozlarni qo‘llab-quvvatlash jamoasi tomonidan tekshirilishi kerak. Tasdiqlashsiz siz tizimga kira olmaysiz.

# notifications
source: Notificiations
ru: Уведомления
uz: Habarlar

# old.password
source: Current password
ru: Текущий пароль
uz: Hozirgi parol

# organization_reqs
source: Organization requisites
ru: Реквизиты организации
uz: Tashkilot rekvizitlari

# otp_sent_to_email
source: Insert OTP sent to the email
ru: Вставьте OTP, отправленный на эл. почта
uz: Elektron pochtaga yuborilgan OTPni kiriting

source: per gallon
ru: за галлон
uz: har galonidan

source: Personal details
ru: Личная информация
uz: Shaxsiy ma'lumotlar

source: Phone number
ru: Номер телефона
uz: Tel. raqami

source: Please wait
ru: Пожалуйста, подождите.
uz: Iltimos kuting

source: Popular stations
ru: Популярные станции
uz: Mashhur stantsiyalar

source: Post feedback
ru: Опубликовать отзыв
uz: Izoh qoldirish

source: Price
ru: Цена
uz: Narx

source: Price update
ru: Обновление цены
uz: Narx yangilash

# price.change.warning
source: Due to market volatility price may have changed
ru: Изменение цены может произойти из-за волатильности рынка
uz: Bozordagi o'zgaruvchanlik tufayli narx o'zgarishi mumkin

source: Price range
ru: Диапазон цен
uz: Narx oraliqi

source: Prices
ru: Цены
uz: Narxlari

source: Profile
ru: Профиль
uz: Profil

source: Profile updated
ru: Профиль обновлен
uz: Yangilandi

# profile_updated_failed
source: Update profile failed
ru: Обновить профиль не удалось
uz: Profil yangilanishda xatolik

# quant.best
source: Quantity (Best price)
ru: Количество (Лучшая цена)
uz: Miqdor (Eng yaxshi narx)

# radius.mile
source: Distance (in miles)
ru: Расстояние (в милях)
uz: Masofa (milada)

source: Region
ru: Регион

# register_warning
source: Your account should be verified by our customer support team. Without verification your are not able to login.
ru: Ваша учетная запись должна быть подтверждена нашей службой поддержки клиентов. Без проверки вы не сможете войти в систему.
uz: Hisobingiz mijozlarni qo‘llab-quvvatlash jamoasi tomonidan tekshirilishi kerak. Tasdiqlashsiz siz tizimga kira olmaysiz.

# registration_failure
source: Registration failed
ru: Регистрация не удалась
uz: Ro‘yxatdan o‘tish amalga oshmadi

# registration_success
source: Successfully registered
ru: Успешная регистрация
uz: Ro'yxatdan o'tkazildi

# reset.pass.failed
source: Failed to reset password
ru: Не удалось сбросить пароль
uz: Parolni tiklashda xatolik

# reset.pass.success
source: New password sent to the email
ru: Новый пароль отправлен на почту
uz: Yangi parol elektron pochtaga yuborildi

source: Retail price %@
ru: Розничная цена %@
uz: Chakana narxi %@

source: Retail price
ru: Розничная цена
uz: Chakana narxi

# retail.price.n
source: Retail price %@
ru: Розничная цена %@
uz: Do'kon narxi %@

source: Retry
ru: Повтор
uz: Takror

source: Save
ru: Сохранять
uz: Foyda

source: Save %@ per gallon
ru: Сэкономьте %@ за галлон
uz: Har galondan %@ tejang

# save.n.galon
source: Save %@ per gallon
ru: Сэкономьте %@ за галлон
uz: Galloniga %@ tejash

source: Search address
ru: Поиск адреса
uz: Manzil qidirish

source: Searching stations
ru: Поиск заправок
uz: AYOQSH qidirlmoqda

source: Searching route
ru: Поиск маршрута
uz: Yo'lni qidirish

source: Security
ru: Безопасность
uz: Havfsizlik

source: Select city
ru: Выберите город
uz: Shaharni tanlang

source: Select state
ru: Выберите штат
uz: Shtatni tanlang

source: Selected
ru: Выбрано
uz: Tanlangan

source: Send request
ru: Отправить запрос
uz: So'rov yuborish

source: Settings
ru: Настройки
uz: Sozlamalar

source: Setup PIN
ru: Установить PIN-код
uz: PIN-kodni sozlash

source: Sorted by
ru: Сортировать по
uz: Tartiblangan

source: State
ru: Штат
uz: Shtat

source: Stations
ru: Станции
uz: Stantsiyalar

source: Stations at radius %@
ru: Станции в радиусе %@
uz: %@ radiusdagi stansiyalar

source: System
ru: Системный
uz: Tizim

source: Theme
ru: Тема
uz: Mavzu

source: To
ru: К месту
uz: U yerga

source: Today
ru: Сегодня
uz: Bugun

source: Total spendings
ru: Всего расходов
uz: Jami xarajatlar

# transf.transactions
source: Recent transactions
ru: Последние транзакции

source: UFC Client Service
ru: Служба поддержки клиентов UFC
uz: UFC Mijoz Xizmati

source: Unknown error
ru: Неизвестная ошибка
uz: Noma'lum xatolik

source: View All
ru: Посмотреть все
uz: Barini ko'rish

source: View larger
ru: Посмотреть больше
uz: Ko'roq

source: View all
ru: Bсе
uz: Barchasi

source: Warning
ru: Внимание!
uz: Diqqat

source: Week
ru: Неделя
uz: Hafta

# welcome_to
source: Welcome to Fuel Finder
ru: Добро пожаловать в Fuel Finder
uz: Fuel Finder ga xush kelibsiz

source: Write comment
ru: Написать комментарий
uz: Izoh yozing

source: Coming soon...
uz: Ishlab chiqilmoqda
